package Lesson4.L4_HW;

public class L4_hw_Task2 {
    // Написать функцию drawRectangle которая рисует в консоли прямоугольник из символов '+'
//       Аргументы функции: ширина прямоугольника в символах, высота прямоугольника в символах
//
//        Например 3 на 2
//        Вывод программы:
//        + + +
//        + + +
//        Задание 3
//        Перегрузить функцию drawRectangle (задание 2) таким образом, чтобы она могла принимать на вход только 1 параметр (ширина квадрата) и рисовать квадрат с равными сторонами
//
//        Например 2
//        Вывод программы:
//        + +
//        + +
//
//        Например 3
//        Вывод программы:
//        + + +
//        + + +
//        + + +

    public static void main(String[] args) {

    }
}
